src/InformationRegisters/ОшибкиЭДОКИсправлению/ОшибкиЭДОКИсправлению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиЭДОКИсправлению</name>
  <resources>
    <name>НастройкиЭДО</name>
    <type>
      <types>CatalogRef.УдалитьСоглашенияОбИспользованииЭД</types>
    </type>
  </resources>
  <resources>
    <name>ГруппироватьУведомленияПоНастройкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметОшибки</name>
    <type>
      <types>DocumentRef.ЭлектронныйДокументВходящийЭДО</types>
      <types>DocumentRef.СообщениеЭДО</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОшибкиЭДОКИсправлению/ManagerModule.bsl
#Область ПрограмныйИнтерфейс

Процедура ДобавитьЗаписьОбОшибке(ПредметОшибки, Описание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПредметОшибки                       = ПредметОшибки;
	МенеджерЗаписи.ОписаниеПроблемы                    = Описание;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписьОбОшибке(ПредметОшибки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПредметОшибки = ПредметОшибки;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтправленностьУведомления(ПредметОшибки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПредметОшибки = ПредметОшибки;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.УведомлениеОтправлено = Истина;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
